In [1]:
from sqlalchemy import create_engine
import pandas as pd
# connexion à la base de données simplon
engine = create_engine("mysql+pymysql://simplon:Simplon2020@localhost/simplon")

In [2]:
#lecture du jeu de données (format excel)
données=pd.read_excel("Data_Professional_Salary_Survey_Responses_1.xlsx")

Aprés avoir modélisé et créé la base de données à partir du jeu de données...
Création des dataframes correspondants aux tables de la base de données

In [4]:
# table sondage
#Création du dataframe correspondant à la table sondage contenant les valeurs uniques de la colone 'Survey Year' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
sondage = pd.DataFrame({'sdg_year': données['Survey Year'].unique()}, columns = ['sdg_year'], index=[i for i in range(1,len(données['Survey Year'].unique())+1)])
sondage
#sondage.to_sql('sondage', if_exists='append', con=engine, index=False)

   sdg_year
1      2021
2      2020
3      2019
4      2018
5      2017

In [5]:
#Création du dataframe correspondant à la table carreer_plan contenant les valeurs uniques de la colone 'CareerPlansThisYear' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
carreer_plan = pd.DataFrame({'cap_plan': données['CareerPlansThisYear'].unique()}, columns = ['cap_plan'], index=[i for i in range(1,len(données['CareerPlansThisYear'].unique())+1)])
#carreer_plan.to_sql('carreer_plan', if_exists='append', con=engine, index=False)
carreer_plan

                                         cap_plan
1          Stay with the same employer, same role
2                               Prefer not to say
3                 Change both employers and roles
4   Stay with the same role, but change employers
5  Stay with the same employer,  but change roles
6                                       Not Asked

In [6]:
#Table Certification
#Création du dataframe correspondant à la table Certification contenant les valeurs uniques de la colone 'Certifications' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
certification = pd.DataFrame({'cert_name': données['Certifications'].unique()}, columns = ['cert_name'], index=[i for i in range(1,len(données['Certifications'].unique())+1)])
#certification.to_sql('certification', if_exists='append', con=engine, index=False)
certification

                          cert_name
1                         Not Asked
2                  No, I never have
3  Yes, and they're currently valid
4             Yes, but they expired

In [7]:
# Table country
#Création du dataframe correspondant à la table country contenant les valeurs uniques de la colone 'Country' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
country = pd.DataFrame({'ctr_name': données['Country'].unique()}, columns = ['ctr_name'], index=[i for i in range(1,len(données['Country'].unique())+1)])
#country.to_sql('country', if_exists='append', con=engine, index=False)
country

          ctr_name
1           Sweden
2    United States
3   United Kingdom
4         Pakistan
5         Paraguay
..             ...
93         Albania
94         Bolivia
95         Vietnam
96         Bermuda
97           Kenya

[97 rows x 1 columns]

In [92]:
#Table database
#Création du dataframe correspondant à la table database contenant les valeurs uniques de la colone 'PrimaryDatabase' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
database = pd.DataFrame({'db_name': données['PrimaryDatabase'].unique()}, columns = ['db_name'], index=[i for i in range(1,len(données['PrimaryDatabase'].unique())+1)])
#database.to_sql('database', if_exists='append', con=engine, index=False)
database

                    db_name
1      Microsoft SQL Server
2                PostgreSQL
3                     Other
4              Azure SQL DB
5          Microsoft Access
6                    Oracle
7             MySQL/MariaDB
8   Amazon RDS (any flavor)
9                   MongoDB
10                      DB2
11                Cassandra
12                   SQLite
13                      SAP
14                 Teradata
15            Elasticsearch

In [8]:
#table education
#Création du dataframe correspondant à la table education contenant les valeurs uniques de la colone 'Education' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
education = pd.DataFrame({'edu_title': données['Education'].unique()}, columns = ['edu_title'], index=[i for i in range(1,len(données['Education'].unique())+1)])
#education.to_sql('education', if_exists='append', con=engine, index=False)
education

                    edu_title
1                   Not Asked
2         Bachelors (4 years)
3  None (no degree completed)
4                     Masters
5        Associates (2 years)
6               Doctorate/PhD

In [9]:
# table employment_sector
#Création du dataframe correspondant à la table employment_sector contenant les valeurs uniques de la colone 'EmploymentSector' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
employment_sector = pd.DataFrame({'sec_name': données['EmploymentSector'].unique()}, columns = ['sec_name'], index=[i for i in range(1,len(données['EmploymentSector'].unique())+1)])
#employment_sector.to_sql('employment_sector', if_exists='append', con=engine, index=False)
employment_sector

                                sec_name
1                       Private business
2  Education (K-12, college, university)
3              State/province government
4                       Local government
5                             Non-profit
6                     Federal government
7                                Student

In [10]:
#table employment_status
#Création du dataframe correspondant à la table employment_status contenant les valeurs uniques de la colone 'EmploymentStatus' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
employment_status = pd.DataFrame({'emp_status': données['EmploymentStatus'].unique()}, columns = ['emp_status'], index=[i for i in range(1,len(données['EmploymentStatus'].unique())+1)])
#employment_status.to_sql('employment_status', if_exists='append', con=engine, index=False)
employment_status['emp_status'].unique()

array(['Full time employee',
       'Full time employee of a consulting/contracting company',
       'Independent consultant, contractor, freelancer,  or company owner',
       'Part time', 'Independent or freelancer or company owner'],
      dtype=object)

In [11]:
# Table how_many_companies
#Création du dataframe correspondant à la table how_many_companies contenant les valeurs uniques de la colone 'HowManyCompanies' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
how_many_companies = pd.DataFrame({'mcp_many_companies': données['HowManyCompanies'].unique()}, columns = ['mcp_many_companies'], index=[i for i in range(1,len(données['HowManyCompanies'].unique())+1)])
#how_many_companies.to_sql('how_many_companies', if_exists='append', con=engine, index=False)
how_many_companies

                                  mcp_many_companies
1  1 (this is the only company where I've had thi...
2                                                  5
3                                                  4
4  2 (I worked at another similar position elsewh...
5                                                  3
6                                          6 or more
7                                          Not Asked

In [12]:
#Table largest_city
#Création du dataframe correspondant à la table largest_city contenant les valeurs uniques de la colone 'PopulationOfLargestCityWithin20Miles' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
largest_city = pd.DataFrame({'pop_name': données['PopulationOfLargestCityWithin20Miles'].unique()}, columns = ['pop_name'], index=[i for i in range(1,len(données['PopulationOfLargestCityWithin20Miles'].unique())+1)])
#largest_city.to_sql('largest_city', if_exists='append', con=engine, index=False)
largest_city

               pop_name
1      <= 20,000 (town)
2      1M+ (metropolis)
3  300K-1M (large city)
4      100K-299K (city)
5  20K-99K (large town)
6             Not Asked

In [60]:
# Table job
#Création du dataframe correspondant à la table job contenant les valeurs uniques de la colone 'JobTitle' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
job = pd.DataFrame({'job_name': données['JobTitle'].unique()}, columns = ['job_name'], index=[i for i in range(1,len(données['JobTitle'].unique())+1)])
#job.to_sql('job', if_exists='append', con=engine, index=False)
job

                                             job_name
1   Developer: Business Intelligence (SSRS, PowerB...
2   DBA (Production Focus - build & troubleshoot s...
3   DBA (General - splits time evenly between writ...
4                                             Manager
5                   Developer: App code (C#, JS, etc)
6                                    Developer: T-SQL
7                                           Architect
8   DBA (Development Focus - tunes queries, indexe...
9                                            Engineer
10                                            Analyst
11                                              Other
12                                     Data Scientist
13                                                DBA
14                        Principal database engineer
15                   DevOps, Sr Software Engineer DBA
16                                        Technician
17                                Database Specialist
18                                         Consultant
19                              Systems Administrator
20                                              Sales
21                                 DBA / BI Developer
22                                     Sr Consultant
23                               Analytics consultant

In [13]:
# Table looking_job
#Création du dataframe correspondant à la table looking_job les valeurs uniques de la colone 'LookingForAnotherJob' du jeu de donnéees, en commerçant  l'index à 1 qui servira de l'ID dans la table , puis y intégrer les données du dataframe 
looking_job=pd.DataFrame({'look_job':données['LookingForAnotherJob'].unique()}, columns=['look_job'], index=[i for i in range(1,len(données['LookingForAnotherJob'].unique())+1)])
#looking_job.to_sql('looking_job', if_exists='append', con=engine, index=False)
looking_job

                                   look_job
1                                 Not Asked
2                                        No
3    Yes, but only passively (just curious)
4  Yes, actively looking for something else

In [14]:
# création de la colonne sgi_id correspondant à l'ID de la table sondageitem

données['sgi_id']=[i for i in range(1,données.shape[0]+1)]
#test=données['KindsOfTasksPerformed'].reset_index()

In [89]:
données

,Survey Year,Timestamp,SalaryUSD,Country,PostalCode,PrimaryDatabase,YearsWithThisDatabase,OtherDatabases,EmploymentStatus,JobTitle,...,OldestVersionInProduction,PopulationOfLargestCityWithin20Miles,EmploymentSector,LookingForAnotherJob,CareerPlansThisYear,Gender,OtherJobDuties,KindsOfTasksPerformed,Counter,sgi_id
0,2021,2020-12-10 08:22:42.696,65000.0,Sweden,NaN,Microsoft SQL Server,4,Microsoft SQL Server,Full time employee,"Developer: Business Intelligence (SSRS, PowerB...",...,SQL Server 2016,"<= 20,000 (town)",Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1,1
1,2021,2020-12-10 08:23:22.242,145000.0,United States,76063,Microsoft SQL Server,15,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2014,1M+ (metropolis),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1,2
2,2021,2020-12-10 08:23:37.909,105000.0,United States,43240,Microsoft SQL Server,12,"PostgreSQL, Azure SQL DB (any flavor)",Full time employee,DBA (General - splits time evenly between writ...,...,SQL Server 2008R2,300K-1M (large city),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1,3
3,2021,2020-12-10 08:23:48.152,46482.0,United Kingdom,NaN,Microsoft SQL Server,10,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2012,300K-1M (large city),"Education (K-12, college, university)",Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1,4
4,2021,2020-12-10 08:24:03.600,98800.0,United States,468,Microsoft SQL Server,5,DB2,Full time employee,"Developer: Business Intelligence (SSRS, PowerB...",...,SQL Server 2012,100K-299K (city),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,2017,2017-01-14 15:50:23.936,36549.0,United Kingdom,Not Asked,Microsoft SQL Server,3,NaN,Full time employee,DBA,...,Not Asked,Not Asked,Private business,No,Not Asked,Not Asked,Not Asked,Not Asked,1,10337
10337,2017,2017-01-15 01:01:21.212,65000.0,Saudi Arabia,Not Asked,Microsoft SQL Server,7,"Oracle, MySQL/MariaDB, Microsoft Access, SQLite",Full time employee,DBA,...,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1,10338
10338,2017,2017-01-15 03:25:47.422,85000.0,Netherlands,Not Asked,Microsoft SQL Server,17,Oracle,Full time employee,Other,...,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1,10339
10339,2017,2017-01-15 03:37:35.305,90000.0,United States,Not Asked,Microsoft SQL Server,8,MySQL/MariaDB,Full time employee,DBA,...,Not Asked,Not Asked,Private business,"Yes, actively looking for something else",Not Asked,Not Asked,Not Asked,Not Asked,1,10340
10340,2017,2017-01-15 03:37:59.149,23000.0,Portugal,Not Asked,Microsoft SQL Server,4,"PostgreSQL, DB2, Microsoft Access",Full time employee,Architect,...,Not Asked,Not Asked,Private business,"Yes, but only passively (just curious)",Not Asked,Not Asked,Not Asked,Not Asked,1,10341

Création dataframe sondage_item

In [94]:
#Création dataframe sondage_item avec les différents traitements à faire sur les colonnepour l'adapter à notre table sondage_item
sondage_item=données.drop(['OtherJobDuties','OtherDatabases','KindsOfTasksPerformed','Counter'],1)
sondage_item['CareerPlansThisYear'].replace(carreer_plan['cap_plan'].tolist(),carreer_plan.index.tolist(),inplace=True)
sondage_item['Survey Year'].replace(sondage['sdg_year'].tolist(),sondage.index.tolist(),inplace=True)
sondage_item['Certifications'].replace(certification['cert_name'].tolist(),certification.index.tolist(),inplace=True)
sondage_item['Country'].replace(country['ctr_name'].tolist(),country.index.tolist(),inplace=True)
sondage_item['PrimaryDatabase'].replace(database['db_name'].tolist(),database.index.tolist(),inplace=True)
sondage_item['Education'].replace(education['edu_title'].tolist(),education.index.tolist(),inplace=True)
sondage_item['EmploymentSector'].replace(employment_sector['sec_name'].tolist(),employment_sector.index.tolist(),inplace=True)
sondage_item['EmploymentStatus'].replace(employment_status['emp_status'].tolist(),employment_status.index.tolist(),inplace=True)
sondage_item['HowManyCompanies'].replace(how_many_companies['mcp_many_companies'].tolist(),how_many_companies.index.tolist(),inplace=True)
sondage_item['PopulationOfLargestCityWithin20Miles'].replace(largest_city['pop_name'].tolist(),largest_city.index.tolist(),inplace=True)
sondage_item['JobTitle'].replace(job['job_name'].tolist(),job.index.tolist(),inplace=True)
sondage_item['LookingForAnotherJob'].replace(looking_job['look_job'].tolist(),looking_job.index.tolist(),inplace=True)
sondage_item['ManageStaff'].replace(sondage_item['ManageStaff'].unique().tolist(),[1,0],inplace=True)
sondage_item['OtherPeopleOnYourTeam'].replace(['None','More than 5'],[0,6], inplace=True)
sondage_item['DatabaseServers'].replace(['Not Asked'],[-1],inplace=True)
sondage_item['EducationIsComputerRelated'].replace(['Not Asked', 'Yes', 'No'],[-1, 1, 0], inplace=True)
sondage_item['EducationIsComputerRelated'].fillna(-1, inplace=True)
sondage_item['HoursWorkedPerWeek'].replace(['Not Asked'],[-1],inplace=True)
sondage_item['Gender'].replace(['Prefer not to say', 'Non-binary/third gender','None','Not Asked','Male','Female'],['other','other','other','na','male','female'], inplace=True)
sondage_item['PostalCode'].replace(['Not Asked'],[-1], inplace=True)
sondage_item['PostalCode'].fillna(-1, inplace=True)
sondage_item['CompanyEmployeesOverall'].replace(['Not Asked','1000 or more'],[-1,1000], inplace=True)
for e in sondage_item['CompanyEmployeesOverall'].unique() :
    if e!=-1:
        nbre_emp=str(e).split('-')
        print(nbre_emp)
        if len(nbre_emp)>1  :
            sondage_item['CompanyEmployeesOverall'].replace(e,round((int(nbre_emp[0])+int(nbre_emp[1]))/2), inplace=True)
# remplacer les more than5 par 6 et None par 0
sondage_item.columns
sondage_item.rename(columns={'Survey Year': 'sdg_id', 
                           'Timestamp': 'timestamp','SalaryUSD': 'salary_usd','Country': 'ctr_id','PostalCode': 'postal_code','PrimaryDatabase': 'primary_db_id','YearsWithThisDatabase': 'years_with_db','EmploymentStatus': 'emp_id','JobTitle': 'job_id','ManageStaff': 'manage_staff','YearsWithThisTypeOfJob': 'years_with_job','HowManyCompanies': 'mcp_id','OtherPeopleOnYourTeam': 'other_people','CompanyEmployeesOverall': 'company_employee','DatabaseServers': 'database_servers','Education': 'edu_id','EducationIsComputerRelated': 'eduction_computer','Certifications': 'cert_id','HoursWorkedPerWeek': 'hours_worked','TelecommuteDaysPerWeek': 'telecommute','NewestVersionInProduction': 'newest_version','OldestVersionInProduction': 'oldest_version','PopulationOfLargestCityWithin20Miles': 'pop_id','EmploymentSector': 'sec_id','LookingForAnotherJob': 'look_id','CareerPlansThisYear': 'cap_id','Gender': 'gender'}, inplace=True)

In [62]:
#intégration de données dans la table sondage_item
#sondage_item.to_sql('sondage_item',if_exists='append',con=engine,index=False)

In [20]:
# Création dataframe KindsOfTasksPerformed_sgi_id
KindsOfTasksPerformed_sgi_id_INTER=données[['KindsOfTasksPerformed','sgi_id']].dropna()
tas_id=[]
sgi_id=[]
for i in KindsOfTasksPerformed_sgi_id_INTER.index:
    for e in KindsOfTasksPerformed_sgi_id_INTER.loc[i][0].split(','): 
        tas_id.append(e)
    for j in KindsOfTasksPerformed_sgi_id_INTER.loc[i][0].split(','):
        sgi_id.append(KindsOfTasksPerformed_sgi_id_INTER.loc[i][1])

In [21]:
# Création du dataframe correspondant à la table d'assosiation 'task_performed'
task_performed=pd.DataFrame({'tas_id':tas_id,'sgi_id':sgi_id}, columns=['tas_id','sgi_id'] )
task_performed

          tas_id  sgi_id
0      Not Asked       1
1      Not Asked       2
2      Not Asked       3
3      Not Asked       4
4      Not Asked       5
...          ...     ...
21744  Not Asked   10337
21745  Not Asked   10338
21746  Not Asked   10339
21747  Not Asked   10340
21748  Not Asked   10341

[21749 rows x 2 columns]

In [22]:
# supprimer les vides au début des champs de la colonne KindsOfTasksPerformed
from re import sub

for i in task_performed['tas_id'].unique():
    task_performed['tas_id'].replace(i,sub('(\s?)(.+)',r"\2",i), inplace=True)
    #KindsOfTasksPerformed_sgi_id['KindsOfTasksPerformed'].map({i: sub('(\s?)(.+)',r"\2",i)})

Construction d une dataframe: task pour la liste de kindsOfTasksPerformed

In [24]:
#Création du dataframe correspondant à la table task à partir de la colonne tas_id
task=pd.DataFrame(task_performed['tas_id'].unique(),columns=['tas_name'], index=[i for i in range(1,len(task_performed['tas_id'].unique())+1) ])

In [139]:
task

                           tas_name
1                         Not Asked
2                      Manual tasks
3             Meetings & management
4                          Projects
5  Build scripts & automation tools
6                  On-call 24/7/365
7                               R&D
8     On-call as part of a rotation
9                 Training/teaching

In [72]:
#Remplacer les intitulés des KindsOfTasksPerformed par leur ID
task_performed.replace(task['tas_name'].tolist(),task['tas_name'].index.to_list(), inplace=True)

In [74]:
task_performed

       tas_id  sgi_id
0           1       1
1           1       2
2           1       3
3           1       4
4           1       5
...       ...     ...
21744       1   10337
21745       1   10338
21746       1   10339
21747       1   10340
21748       1   10341

[21749 rows x 2 columns]

In [73]:
#task.to_sql('task',if_exists='append', con=engine, index=False)
#task_performed.to_sql('task_performed', if_exists='append', con=engine,index=False)

In [15]:
#Insertion des données dans la table other_duties
jobduties=pd.DataFrame(données['OtherJobDuties'].unique(),columns=['job_name'], index=[i for i in range(1,len(données['OtherJobDuties'].unique())+1) ])
jobduties

                                              job_name
1                                            Not Asked
2    DBA (Development Focus - tunes queries, indexe...
3                                              Manager
4    DBA (Production Focus - build & troubleshoot s...
5    Architect, DBA (Development Focus - tunes quer...
..                                                 ...
548  Architect, DBA (Production Focus - build & tro...
549  Architect, Developer: Business Intelligence (S...
550  Analyst, Architect, DBA (General - splits time...
551  Architect, DBA (Development Focus - tunes quer...
552  Architect, Data Scientist, Developer: T-SQL, M...

[552 rows x 1 columns]

In [18]:
#Création du dataframe other_duties correspondant à la table other_duties dans la BDD
#dabors il faut remplacer les ',' qui sont entre parenthèses par ';', pour pouvoir récupérer tous les jobs séparés par ','
from re import findall
other_duties_INTER=données[['OtherJobDuties','sgi_id']].dropna()
other_duties_INTER=other_duties_INTER.reset_index(drop=True)
#jobDuties = other_duties_INTER['OtherJobDuties']
#from re import findall
for index,job in enumerate(other_duties_INTER['OtherJobDuties']):
    jobfind=findall('\([^)]+\)',job) #Trouver tous les job qui sont entre parenthèses
    if len(jobfind )>0:
        for i,v in enumerate(jobfind):
            jobfind[i]=v.replace(',',';')
            other_duties_INTER['OtherJobDuties'][index]=other_duties_INTER['OtherJobDuties'][index].replace(v, jobfind[i])
#Récupérer individuellement tous les jobs séparés par les ','
OtherJobDuties_id=[]
sgi_id=[]
for i in other_duties_INTER.index:
    for e in other_duties_INTER.loc[i][0].split(','): 
        OtherJobDuties_id.append(e)
    for j in other_duties_INTER.loc[i][0].split(','):
        sgi_id.append(other_duties_INTER.loc[i][1])

<ipython-input-18-360c0786464f>:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_duties_INTER['OtherJobDuties'][index]=other_duties_INTER['OtherJobDuties'][index].replace(v, jobfind[i])

In [19]:
other_duties=pd.DataFrame({'job_id':OtherJobDuties_id,'sgi_id':sgi_id}, columns=['job_id','sgi_id'] )
other_duties

          job_id  sgi_id
0      Not Asked       1
1      Not Asked       2
2      Not Asked       3
3      Not Asked       4
4      Not Asked       5
...          ...     ...
14378  Not Asked   10337
14379  Not Asked   10338
14380  Not Asked   10339
14381  Not Asked   10340
14382  Not Asked   10341

[14383 rows x 2 columns]

In [20]:
#remettre les ',' qui ont été remplacés par les ';'
for index,job in enumerate(other_duties['job_id']):
    other_duties['job_id'][index]=job.replace(';',',')

<ipython-input-20-5fb5c8d1e1e7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_duties['job_id'][index]=job.replace(';',',')

In [46]:
#supprimer le vide en début de job dans other_duties
from re import sub
for i in other_duties['job_id'].unique():
    other_duties['job_id'].replace(i,sub('(\s?)(.+)',r"\2",i), inplace=True)

In [63]:
#Ajouter les jobduties qui n existent pas dans la table job
job_not_in_table=[] # une liste qui va se remplir que des job qui sont dans jobduties et qui ne sont pas dans la table job
for other_job in other_duties['job_id'].unique():
    if other_job not in job['job_name'].unique():
        job_not_in_table.append(other_job)
        job=job.append({'job_name':other_job}, ignore_index=True)
job.index = range(1,len(job.index)+1)#réindexer job pour qu'il commence par 1

In [66]:
#Création du dataframe jobNotInTable des jobs qui n existent pas dans la table Job puis y intégrer
jobNotInTable=pd.DataFrame(job_not_in_table,columns=['job_name'])
#jobNotInTable.to_sql('job',if_exists='append',con=engine,index=False)

In [70]:
#remplacer les intitulés des jobs par leurs Id pour les intégrer dans la table d'assosiation 'other_duties'
other_duties.replace(job['job_name'].tolist(),job['job_name'].index.to_list(), inplace=True)
#other_duties.to_sql('other_duties',if_exists='append',con=engine,index=False)

       job_id  sgi_id
0          24       1
1          24       2
2          24       3
3          24       4
4          24       5
...       ...     ...
14378      24   10337
14379      24   10338
14380      24   10339
14381      24   10340
14382      24   10341

[14383 rows x 2 columns]

In [74]:
#Création du dataframe coresspondant à la table 'other_database' 
other_database_INTER=données[['OtherDatabases','sgi_id']].dropna()
db_id=[]
sgi_id=[]
for i in other_database_INTER.index:
    for e in other_database_INTER.loc[i][0].split(','): 
        db_id.append(e)
    for j in other_database_INTER.loc[i][0].split(','):
        sgi_id.append(other_database_INTER.loc[i][1])

In [85]:
#dataframe other_database
other_database=pd.DataFrame({'db_id':db_id,'sgi_id':sgi_id}, columns=['db_id','sgi_id'] )
#supprimer le vide en début de db_id dans other_database
for i in other_database['db_id'].unique():
    other_database['db_id'].replace(i,sub('(\s*)(.+)',r"\2",i), inplace=True)
#Supprimer les parenthèse avec ce qu'il y a dedans des db    
for index,db in enumerate(other_database['db_id']):
    other_database['db_id'][index]=other_database['db_id'][index].replace(db,(sub('([^()]+)(\(.+\))',r"\1",db)) )

In [ ]:

#Ajouter les other database qui n existent pas dans la table database
db_not_in_table=[] # une liste qui va se remplir que des job qui sont dans jobduties et qui ne sont pas dans la table job
for other_db in other_database['db_id'].unique():
    if other_db not in database['db_name'].unique():
        db_not_in_table.append(other_db)
        database=database.append({'db_name':other_db}, ignore_index=True)
database.index = range(1,len(database.index)+1)#réindexer database pour qu'il commence par 1

In [ ]:
#Création du dataframe dbNotInTable des databases qui n existent pas dans la table database puis y intégrer
dbNotInTable=pd.DataFrame(db_not_in_table,columns=['db_name'])
#dbNotInTable.to_sql('database',if_exists='append',con=engine,index=False)

In [ ]:
#remplacer les intitulés des database par leurs Id pour les intégrer dans la table d'assosiation 'other_duties'
other_database.replace(database['db_name'].tolist(),database['db_name'].index.to_list(), inplace=True)
#other_database.to_sql('other_database',if_exists='append',con=engine,index=False)